Tekla Open API Reference for Tekla Structures 2025
AnalysisPartAnalysisProperties.AnalysisClass Property
 The analysis class of the analysis part.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisPartAnalysisProperties.AnalysisClassEnum AnalysisClass { get; set; }
Public Property AnalysisClass As AnalysisPartAnalysisProperties.AnalysisClassEnum
	Get
	Set
Property Value
Type: AnalysisPartAnalysisProperties.AnalysisClassEnum
See Also
Reference
AnalysisPartAnalysisProperties Class
Tekla.Structures.Analysis Namespace